codeigniter4-framework-b3359be/app/Controllers/Api/Livres.php

UPDATE `livres` SET `annee` = 1995
WHERE `livres`.`id` IN ('4')
---
    public function update($id = null)
    {
        // TODO 1 : 404 si le livre n'existe pas.
        $livre = $this->model->find($id);
        if(!$livre){
            return $this->response->setStatusCode(404)->setJSON(["Le livre" . $id . "not found"]);
        }
        // TODO 2 : décider comment traiter PUT (remplacement complet)
        //          et PATCH (modification partielle).
        //          Indice : $this->request->getMethod()
        $method = $this->request->getMethod();
        if($method == 'PUT'){
            $body = $this->request->getJSON(true);
            $this->model->update($id, $body);

DELETE FROM `livres`
WHERE `id` IN ('4')
---
    public function delete($id = null)
    {
        // TODO : 404 si le livre n'existe pas, sinon supprimer.
        //        200 ou 204 ? Choisissez et justifiez en commentaire.
        $livre = $this->model->find($id);
        if(!$livre){
            return $this->failNotFound($livre, 404);
        }
        $this->model->delete($id);